Catalogs/СервисПровайдерыСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СервисПровайдерыСУЗ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСервисПровайдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьВидыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварныеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СервисПровайдерыСУЗ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	ОбновлениеИнформационнойБазыГосИС.ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
		Обработчики,
		ПустаяСсылка().Метаданные(),
		Новый УникальныйИдентификатор("b1a5fd8d-9030-4dee-b130-07726edf9eec"));
	
КонецПроцедуры

// Регистрирует данные для обработчика обновления перехода на конструктор настроек
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = Метаданные.Справочники.СервисПровайдерыСУЗ.ПолноеИмя();
	ПараметрыВыборки.СпособВыборки       = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СервисПровайдерыСУЗ.УдалитьВидыПродукции КАК Таблица
		|ГДЕ
		|	Таблица.НомерСтроки = 1";
	
	Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные);
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных     = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта     = ОбъектМетаданных.ПолноеИмя();
	ОбработанныхОбъектов = 0;
	ПроблемныхОбъектов   = 0;
	ОбновляемыеДанные    = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	ПроблемыСДанными     = Новый Соответствие();
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
			Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	КешКонвертаций = ОбновлениеИнформационнойБазыГосИС.КешКонвертацийВидаПродукции();
	
	Для Каждого ДанныеКОбработке Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ПоляБлокировки = Новый Структура("Ссылка", ДанныеКОбработке.Ссылка);
			ОбщегоНазначенияИС.УстановитьУправляемуюБлокировку(ПолноеИмяОбъекта, ПоляБлокировки);
			
			ОбъектДанных = ДанныеКОбработке.Ссылка.ПолучитьОбъект();
			
			Если ОбъектДанных = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ДанныеКОбработке.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ТоварныеГруппы = Новый Соответствие();
			Для Каждого СтрокаТаблицы Из ОбъектДанных.УдалитьВидыПродукции Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВидПродукции) Тогда
					Продолжить;
				КонецЕсли;
				
				ТоварнаяГруппа = ОбновлениеИнформационнойБазыИСМП.ТоварнаяГруппаПоПеречислениюВидПродукции(
						СтрокаТаблицы.ВидПродукции,
						КешКонвертаций);
				Если Не ЗначениеЗаполнено(ТоварнаяГруппа) Тогда
					ВызватьИсключение СтрШаблон(
						НСтр("ru = 'Не удалось получить товарную группу по виду продукции ""%1""'"),
						СтрокаТаблицы.ВидПродукции);
				КонецЕсли;
				ТоварныеГруппы.Вставить(ТоварнаяГруппа);
				
			КонецЦикла;
			
			Для Каждого КлючИЗначение Из ТоварныеГруппы Цикл
				НоваяСтрока = ОбъектДанных.ТоварныеГруппы.Добавить();
				НоваяСтрока.ТоварнаяГруппа = КлючИЗначение.Ключ;
			КонецЦикла;
			
			Если ОбъектДанных.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДанных, Ложь);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ДанныеКОбработке.Ссылка);
			КонецЕсли;
			
			ОбработанныхОбъектов = ОбработанныхОбъектов + 1;
			
			ЗафиксироватьТранзакцию();

		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не удалось обработать ""%1"" при переходе на конструктор настроек видов продукции по причине:
					       |%2'"),
				ДанныеКОбработке.Ссылка,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектДанных,,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Для Каждого НеобработанныйОбъект Из ПроблемыСДанными Цикл
		ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
			НеобработанныйОбъект.Ключ,
			НеобработанныйОбъект.Значение,
			Параметры);
	КонецЦикла;
	
	Если ОбработанныхОбъектов = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые данные ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция ""%1"": %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектМетаданных.Синоним, ОбработанныхОбъектов);
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			ОбъектМетаданных,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов = Параметры.ПрогрессВыполнения.ОбработаноОбъектов
		+ ОбработанныхОбъектов;
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
